#==============================================================================
# データ変換クラス
#==============================================================================
class CComCnvData {
    # メンバ
    $arrHeader
    $delimiter

    #============================================================
    # コンストラクタ
    #------------------------------------------------------------
    # 引数 : なし
    #============================================================
    CComCnvData(){
        $this.arrHeader = @()
        $this.delimiter = " "
    }

    #============================================================
    # CSVに変換
    #------------------------------------------------------------
    # 引数   : $pData : 変換元データ
    # 戻り値 : CSVデータ
    #============================================================
    [object[]] DataToCsv($pData){
        $data = ""
        return $data
    }

    #============================================================
    # デリミタ設定
    #------------------------------------------------------------
    # 引数   : $pDelimiter : デリミタ
    # 戻り値 : なし
    #============================================================
    [void] SetDelimiter($pDelimiter){
        $this.delimiter = $pDelimiter
    }

    #============================================================
    # ファイル読み込み
    #------------------------------------------------------------
    # 引数   : $pFilePath : ファイルパス
    # 戻り値 : なし
    #============================================================
    [void] ReadFile($pFilePath){
        $this.filePath = $pFilePath
        $this.fileData = Get-Content $this.filePath
        test001
    }

    #============================================================
    # ファイル書き込み
    #------------------------------------------------------------
    # 引数   : なし
    # 戻り値 : なし
    #============================================================
    [void] WriteFile(){
        Set-Content $this.filePath $this.fileData
    }

    #============================================================
    # CSVファイル書き込み(カスタムオブジェクト指定)
    #------------------------------------------------------------
    # 引数   : $pObjData : 出力データ(カスタムオブジェクト指定)
    # 戻り値 : なし
    #============================================================
    [void] WriteCsvFileCustomObj($pObjData){
        $outData = @()
        #列名を取り出す
        $colNames = $pObjData[0].psobject.properties.name

        # ヘッダ
        $outData += ($colNames -join $this.delimiter)

        # 明細
        $pObjData | ForEach-Object {
            $rec = $_
            $arr = @()
            $colNames | ForEach-Object {$arr += $rec.$_}
            $outData += ($arr -join $this.delimiter)
        }

        $this.fileData = $outData
        $this.WriteFile()
    }

    #============================================================
    # データリスト取得
    #------------------------------------------------------------
    # 引数   : なし
    # 戻り値 : データリスト
    #============================================================
    [object[]] GetData(){
        return $this.fileData
    }

    #============================================================
    # データリスト取得(ヘッダ除外)
    #------------------------------------------------------------
    # 引数   : なし
    # 戻り値 : データリスト
    #============================================================
    [object[]] GetDataNotHeader(){
        # ヘッダ以外
        return $this.fileData | Where-Object {-not ($this.CheckHeader($_))}
    }

    #============================================================
    # データリスト取得(項目値で抽出)(ヘッダ除外)
    #------------------------------------------------------------
    # 引数   : $pWhere : 抽出項目値(項目IDXと抽出項目値のハッシュテーブル)
    # 戻り値 : データリスト
    #------------------------------------------------------------
    # 抽出項目値との一致判定は -cLike で判定する
    #============================================================
    [object[]] GetDataWhere($pWhereList){
        return $this.fileData | Where-Object {
            $ret = $true
            if ($this.CheckHeader($_)){
                $ret = $false    
            }
            else {
                $arr = $_.Split($this.delimiter)             
                foreach($key in $pWhereList.Keys){
                    $val = $pWhereList[$key]
                    if (-not ($arr[$key] -cLike $val)){
                        $ret = $false    
                        break
                    }
                }
            }
            return $ret
        }
    }

    #============================================================
    # データリスト取得(カスタムオブジェクト)(ヘッダ除外)
    #------------------------------------------------------------
    # 引数   : $pWhere : 抽出項目値(項目IDXと抽出項目値のハッシュテーブル)
    # 戻り値 : データリスト
    #------------------------------------------------------------
    # 抽出項目値との一致判定は -cLike で判定する
    #============================================================
    [object[]] GetDataCustomObj(){
        $objData = @()
        if ($this.fileData.Length -le 0){
            return $objData
        }

        #ヘッダから列名を取り出す
        $colNames = $this.fileData[0].Split($this.delimiter).Trim()

        $this.fileData | ForEach-Object {
            if ( -not $this.CheckHeader($_)){
                # ハッシュを作成
                $hashData=[ordered]@{}    

                $arr = $_.Split($this.delimiter)             

                for ($i = 0 ; $i -lt $colNames.Length ; $i++){
                    if ($arr.Length -gt $i){
                        $hashData += @{$colNames[$i] = $arr[$i]}
                    }
                    else {
                        $hashData += @{$colNames[$i] = ""}
                    }
                }
                # ハッシュからカスタムオブジェクトにキャスト
                $objData += [pscustomobject]$hashData
            }
        }
        return $objData
    }

    #============================================================
    # ヘッダ判定文字列設定
    #------------------------------------------------------------
    # 引数   : $pArrStrHeader : ヘッダ判定文字列の配列
    # 戻り値 : なし
    #============================================================
    [void] SetStrHeader([string[]]$pArrStrHeader){
        $this.arrStrHeader = $pArrStrHeader
    }

    #============================================================
    # ヘッダ判定
    #------------------------------------------------------------
    # 引数   : $pRec : 判定対象のレコード
    # 戻り値 : ヘッダレコードの場合:$true, 以外:$false
    #============================================================
    [bool] CheckHeader($pRec){
        $ret = $false

        $arr = -Split $pRec
        if ($this.arrStrHeader -contains $arr[0]){
            $ret = $true
        }

        return $ret
    }

    #============================================================
    # レコード処理設定
    #------------------------------------------------------------
    # 引数   : $pRecProc : レコード処理関数
    # 戻り値 : なし
    #============================================================
    [void] SetRecProc($pRecProc){
        $this.funcRecProc = $pRecProc
    }

    #============================================================
    # レコード処理実行
    #------------------------------------------------------------
    # 引数   : なし
    # 戻り値 : なし
    #============================================================
    [void] ExecRecProc(){
        $this.GetDataNotHeader() | ForEach-Object $this.funcRecProc
    }
}
