#==============================================================================
# ファイルアクセスクラス
#==============================================================================
class CComFileAccess {
    # メンバ
    $filePath
    $fileData
    $arrStrHeader    # ヘッダ行と判定する文字列

    #============================================================
    # コンストラクタ
    #------------------------------------------------------------
    # 引数 : なし
    #============================================================
    CComFileAccess(){
        $this.filePath = ""
        $this.fileData = ""
        $this.arrStrHeader = @()
    }

    #============================================================
    # ファイル読み込み
    #------------------------------------------------------------
    # 引数   : $pFilePath : ファイルパス
    # 戻り値 : なし
    #============================================================
    [void] ReadFile($pFilePath){
        $this.filePath = $pFilePath
        $this.fileData = Get-Content $this.filePath
    }

    #============================================================
    # データリスト取得
    #------------------------------------------------------------
    # 引数   : なし
    # 戻り値 : データリスト
    #============================================================
    [object[]] GetData(){
        return $this.fileData
    }

    #============================================================
    # データリスト取得(ヘッダ除外)
    #------------------------------------------------------------
    # 引数   : なし
    # 戻り値 : データリスト
    #============================================================
    [object[]] GetDataNotHeader(){
        # ヘッダ以外
        return $this.fileData | Where-Object {-not ($this.CheckHeader($_))}
    }

    #============================================================
    # ヘッダ判定文字列設定
    #------------------------------------------------------------
    # 引数   : $pArrStrHeader : ヘッダ判定文字列の配列
    # 戻り値 : なし
    #============================================================
    [void] SetStrHeader([string[]]$pArrStrHeader){
        $this.arrStrHeader = $pArrStrHeader
    }

    #============================================================
    # ヘッダ判定
    #------------------------------------------------------------
    # 引数   : $pRec : 判定対象のレコード
    # 戻り値 : ヘッダレコードの場合:$true, 以外:$false
    #============================================================
    [bool] CheckHeader($pRec){
        $ret = $false

        $arr = -Split $pRec
        if ($this.arrStrHeader -contains $arr[0]){
            $ret = $true
        }

        return $ret
    }
}
